Repository: iloncka-ds/culicidaelab-mobile
Catalog: lib/l10n/app_*.arb
Languages: es, ru

# homePageBannerTitle
source: Mosquito Classification
es: Clasificación de Mosquitos
ru: Классификация комаров

# homePageBannerSubtitle
source: Identify mosquito species and learn about potential disease vectors
es: Identifica especies de mosquitos y aprende sobre posibles vectores de enfermedades
ru: Приложение поможет определить виды комаров и узнать информацию о потенциальных переносчиках болезней

# classifyMosquitoButtonTitle
source: Classify Mosquito
es: Clasificar Mosquito
ru: Определите вид комара

# classifyMosquitoButtonSubtitle
source: Take or upload a photo for identification
es: Toma o sube una foto para identificación
ru: Сделайте или загрузите фото для определения вида комара

# mosquitoGalleryButtonTitle
source: Mosquito Gallery
es: Galería de Mosquitos
ru: Информация об опасных видах комаров

# mosquitoGalleryButtonSubtitle
source: Browse common mosquito species
es: Explora especies comunes de mosquitos
ru: Узнайте больше информации об эпидемиологически опасных видах комаров

# diseasesInfoButtonTitle
source: Diseases Info
es: Información de Enfermedades
ru: Информация о болезнях

# diseasesInfoButtonSubtitle
source: Learn about vector-borne diseases
es: Aprende sobre enfermedades transmitidas por vectores
ru: Узнайте о болезнях, передаваемых комарами-переносчиками

# appDisclaimerTitle
source: Disclaimer:
es: Descargo de responsabilidad:
ru: Отказ от ответственности:

# appDisclaimerBody
source: This platform is for educational and research purposes only. It does not replace professional medical advice or guidance from public health authorities.
es: Esta plataforma es únicamente para fines educativos y de investigación. No reemplaza el asesoramiento médico profesional ni la orientación de las autoridades de salud pública.
ru: Эта платформа предназначена только для образовательных и исследовательских целей. Она не заменяет профессиональную медицинскую консультацию или методические указания и приказы органов общественного здравоохранения.

# appFooterGrantInfo
source: CulicidaeLab development is supported by a grant from the Foundation for Assistance to Small Innovative Enterprises (FASIE) https://fasie.ru
es: El desarrollo de CulicidaeLab cuenta con el apoyo de una subvención de la Fundación para la Asistencia a Pequeñas Empresas Innovadoras (FASIE) https://fasie.ru
ru: Разработка CulicidaeLab поддерживается грантом Фонда содействия инновациям https://fasie.ru

# loadingModelDialogTitle
source: Loading Model
es: Cargando Modelo
ru: Загрузка модели

# loadingModelDialogContent
source: Please wait while the classification model is loading...
es: Por favor espera mientras se carga el modelo de clasificación...
ru: Пожалуйста, подождите, пока загружается модель классификации...

# classificationScreenTitle
source: Classify Mosquito
es: Clasificar Mosquito
ru: Классифицировать комара

# uploadImageHint
source: Upload a clear image of a mosquito for identification
es: Sube una imagen clara de un mosquito para su identificación
ru: Загрузите четкое изображение комара для идентификации

# uploadImageSubHint
source: Best results with well-lit, focused images
es: Mejores resultados con imágenes bien iluminadas y enfocadas
ru: Более точные результаты можно получить только с хорошо освещенными, сфокусированными изображениями

# speciesLabel
source: Species: {speciesName}
es: Especie: {speciesName}
ru: Вид: {speciesName}

# commonNameLabel
source: Common Name: {commonName}
es: Nombre Común: {commonName}
ru: Обыденное название: {commonName}

# confidenceLabel
source: Confidence: {confidenceValue}%
es: Confianza: {confidenceValue}%
ru: Точность: {confidenceValue}%

# inferenceTimeLabel
source: Time: {timeValue} ms
es: Tiempo: {timeValue} ms
ru: Время: {timeValue} мс

# speciesInfoButton
source: Species Info
es: Info de Especie
ru: Информация о виде

# diseaseRisksButton
source: Disease Risks
es: Riesgos de Enfermedad
ru: Риски заболеваний

# noKnownDiseaseRisks
source: No known disease risks for this species
es: No se conocen riesgos de enfermedad para esta especie
ru: Для этого вида не известны риски заболеваний

# potentialDiseaseRisksTitle
source: Potential Disease Risks
es: Riesgos Potenciales de Enfermedad
ru: Риски заболеваний

# potentialDiseaseRisksSubtitle
source: This mosquito species is known to transmit the following diseases:
es: Se sabe que esta especie de mosquito transmite las siguientes enfermedades:
ru: Известно, что этот вид комаров передает следующие заболевания:

# disclaimerEducationalUse
source: Disclaimer: This app provides information for educational purposes only. Always consult healthcare professionals for proper diagnosis and treatment.
es: Descargo de responsabilidad: Esta aplicación proporciona información únicamente con fines educativos. Siempre consulte a profesionales de la salud para un diagnóstico y tratamiento adecuados.
ru: Заявление об ограничении ответственности: Это приложение предоставляет информацию только в образовательных целях. Всегда консультируйтесь с медицинскими работниками для правильной диагностики и лечения.

# cameraButtonLabel
source: Camera
es: Cámara
ru: Камера

# galleryButtonLabel
source: Gallery
es: Galería
ru: Галерея

# resetButtonLabel
source: Reset
es: Reiniciar
ru: Сброс

source: Analyzing image...
es: Analizando imagen...
ru: Подождите, пока происходит обработка и анализ изображения...

# analyzeButton
source: Analyze
es: Analizar
ru: Определить вид

# noImageSelectedTitle
source: No Image Selected
es: No Hay Imagen Seleccionada
ru: Изображение не выбрано

# noImageSelectedSubtitle
source: Take a photo or select from gallery
es: Toma una foto o selecciona de la galería
ru: Сделайте фото или выберите из галереи

# unknownSpecies
source: Unknown
es: Desconocido
ru: Информация отсутствует

# errorFailedToPickImage
source: Failed to pick image: {error}
es: Error al seleccionar imagen: {error}
ru: Не удалось выбрать изображение: {error}

# errorNoImageSelected
source: No image selected
es: No se ha seleccionado ninguna imagen
ru: Изображение не выбрано

# errorClassificationFailed
source: Classification failed: {error}
es: Falló la clasificación: {error}
ru: Ошибка классификации: {error}

# errorFailedToLoadModel
source: Failed to load model: {error}
es: Error al cargar el modelo: {error}
ru: Не удалось загрузить модель: {error}

# mosquitoGalleryScreenTitle
source: Mosquito Species Gallery
es: Galería de Especies de Mosquitos
ru: Информация об эпидемиологически опасных видах комаров

# searchMosquitoSpeciesHint
source: Search mosquito species...
es: Buscar especies de mosquitos...
ru: Поиск видов комаров...

source: An error occurred
es: Ocurrió un error
ru: Произошла ошибка

# retryButton
source: Retry
es: Reintentar
ru: Повторить

source: No mosquito species found
es: No se encontraron especies de mosquitos
ru: Запрашиваемые виды комаров не найдены

# tryDifferentSearchTerm
source: Try a different search term
es: Intenta un término de búsqueda diferente
ru: Попробуйте другой поисковый запрос

# habitatLabel
source: Habitat: {habitat}
es: Hábitat: {habitat}
ru: Среда обитания: {habitat}

# diseaseVectorsCount
source: {count,plural, =0{No known disease} =1{1 disease} other{{count} diseases}}
es: {count,plural, =0{No se conocen} =1{1 enfermedad} other{{count} enfermedades}}
ru: {count,plural, zero{Неизвестно} one{1 заболевание} few{{count} заболевания} many{{count} заболеваний} other{{count} заболеваний}}

# noKnownDiseaseVectors
source: No known
es: No se conocen
ru: Не известно

# diseaseDetailScreenDescription
source: Description
es: Descripción
ru: Описание

# diseaseDetailScreenSymptoms
source: Symptoms
es: Síntomas
ru: Симптомы

# diseaseDetailScreenTreatment
source: Treatment
es: Tratamiento
ru: Лечение

# diseaseDetailScreenPrevention
source: Prevention
es: Prevención
ru: Профилактика

# diseaseDetailScreenPrevalence
source: Prevalence
es: Prevalencia
ru: Распространенность

# diseaseDetailScreenTransmittedBy
source: Transmitted by
es: Transmitido por
ru: Передается через

# diseaseDetailScreenUnknownVector
source: Unknown Vector
es: Vector Desconocido
ru: Неизвестный переносчик

# diseaseDetailScreenInfoNotAvailable
source: Information not available.
es: Información no disponible.
ru: Информация недоступна.

# diseaseDetailScreenVectorsNotAvailable
source: Information about vectors not available.
es: Información sobre vectores no disponible.
ru: Информация о переносчиках недоступна.

# mosquitoDetailScreenDescription
source: Description
es: Descripción
ru: Описание

# mosquitoDetailScreenHabitat
source: Habitat
es: Hábitat
ru: Среда обитания

# mosquitoDetailScreenDistribution
source: Distribution
es: Distribución
ru: Распространение

# mosquitoDetailScreenAssociatedDiseases
source: Associated Diseases
es: Enfermedades Asociadas
ru: Связанные заболевания

# mosquitoDetailScreenNoAssociatedDiseases
source: No known diseases associated with this species in our database.
es: No se conocen enfermedades asociadas con esta especie en nuestra base de datos.
ru: С этим видом не связаны известные заболевания.

# diseaseInfoScreenTitle
source: Mosquito-borne Diseases
es: Enfermedades Transmitidas por Mosquitos
ru: Болезни, передаваемые комарами

# searchDiseasesHint
source: Search diseases...
es: Buscar enfermedades...
ru: Поиск болезней...

source: No diseases found
es: No se encontraron enfermedades
ru: Информация о заболеваниях отсутствует

# vectorsLabel
source: Vectors: {vectors}
es: Vectores: {vectors}
ru: Комары-переносчики: {vectors}

# prevalenceLabel
source: Prevalence: {prevalence}
es: Prevalencia: {prevalence}
ru: Распространенность: {prevalence}

# classificationServiceUnknownSpeciesCommonName
source: Unknown Species
es: Especie Desconocida
ru: Неизвестно

# classificationServiceUnknownSpeciesDescription
source: No detailed information available for this species.
es: No hay información detallada disponible para esta especie.
ru: Информация отсутствует.

# classificationServiceUnknownSpeciesHabitat
source: Unknown
es: Desconocido
ru: Неизвестно

# classificationServiceUnknownSpeciesDistribution
source: Unknown
es: Desconocido
ru: Неизвестно

# classificationServiceErrorModelNotLoaded
source: Model not loaded
es: Modelo no cargado
ru: Модель не загружена

# classificationServiceErrorModelLoadingFailed
source: Model loading failed - only supported for Android/iOS
es: Falló la carga del modelo - solo compatible con Android/iOS
ru: Ошибка загрузки модели - поддерживается только для Android/iOS

# viewModelErrorFailedToLoadDiseases
source: Failed to load diseases: {error}
es: Error al cargar enfermedades: {error}
ru: Не удалось загрузить информацию о заболеваниях: {error}

# viewModelErrorFailedToLoadDisease
source: Failed to load disease: {error}
es: Error al cargar enfermedad: {error}
ru: Не удалось загрузить информацию о заболевании: {error}

# viewModelErrorFailedToLoadDiseasesForVector
source: Failed to load diseases for vector: {error}
es: Error al cargar enfermedades por vector: {error}
ru: Не удалось загрузить заболевания, специфичные для переносчика: {error}

# viewModelErrorFailedToLoadMosquitoSpecies
source: Failed to load mosquito species: {error}
es: Error al cargar especies de mosquitos: {error}
ru: Не удалось загрузить виды комаров: {error}

# homePageMosquitoActivityMapButtonTitle
source: Mosquito Activity Map
es: Mapa de Actividad de Mosquitos
ru: Карта активности комаров

# homePageMosquitoActivityMapButtonSubtitle
source: View interactive map of mosquito reports
es: Ver mapa interactivo de reportes de mosquitos
ru: Просмотр интерактивной карты об активности и распространённости комаров

# webViewScreenTitleMosquitoMap
source: Mosquito Activity Map
es: Mapa de Actividad de Mosquitos
ru: Карта активности комаров

# webViewFailedToLoad
source: Failed to load page
es: No se pudo cargar la página
ru: Не удалось загрузить страницу

# webViewRetryButton
source: Retry
es: Reintentar
ru: Повторить

# tooltipSelectLanguage
source: Select language
es: Seleccionar idioma
ru: Выберите язык

# addDetailsButton
source: Add Observation Details
es: Agregar detalles de la observación
ru: Поделиться информацией о наблюдении

# thankYouForParticipation
source: Thank you for your contribution!
es: ¡Gracias por tu contribución!
ru: Спасибо за ваш вклад!

# submissionIdLabel
source: Submission ID: {id}
es: ID de envío: {id}
ru: ID отправки: {id}

# errorSubmissionFailed
source: Submission Failed: {error}
es: Error en el envío: {error}
ru: Ошибка отправки: {error}

# observationDetailsTitle
source: Observation Details
es: Detalles de la observación
ru: Дополнительная информация

# locationSectionTitle
source: Observation Location
es: Ubicación de la observación
ru: Местоположение наблюдения

# locationInstruction
source: Tap on the map to mark the exact location of your observation.
es: Toca en el mapa para marcar la ubicación exacta de tu observación.
ru: Нажмите на карту, чтобы отметить точное местоположение вашего наблюдения.

# fieldRequiredError
source: This field is required
es: Este campo es obligatorio
ru: Это поле обязательно для заполнения

# locationRequiredError
source: Please select a location on the map.
es: Por favor, selecciona una ubicación en el mapa.
ru: Пожалуйста, выберите местоположение на карте.

# notesLabel
source: Notes
es: Notas
ru: Примечания

# notesHint
source: Add any relevant details (e.g., time of day, weather, environment)...
es: Añade cualquier detalle relevante (p. ej., hora del día, clima, entorno)...
ru: Добавьте любые важные детали (например, время суток, погода, окружение)...

# submitObservationButton
source: Submit Observation
es: Enviar observación
ru: Отправить

# predictionSummaryTitle
source: Prediction Summary
es: Resumen de la predicción
ru: Результаты

# latitudeLabel
source: Latitude
es: Latitud
ru: Широта

# longitudeLabel
source: Longitude
es: Longitud
ru: Долгота

source: Submitting Observation...
es: Presentación de observaciones...
ru: Загрузка данных на сервер. Подождите...

source: Fetching Web Prediction...
es: Obteniendo predicción web...
ru: Получение данных с сервера...

# errorFailedWebPrediction
source: Failed to get web prediction. Please try again.
es: No se pudo obtener la predicción web. Inténtalo de nuevo.
ru: Не удалось получить данные с сервера. Пожалуйста, попробуйте еще раз.

# speciesNotDefinedWebPrediction
source: Species not defined
es: Especie no definida
ru: Вид не определен

# retryButtonLabel
source: Retry
es: Rever
ru: Повторить
